[
  {
    "id": "zaatar",
    "slug": "zaatar",
    "commonName": "Thyme",
    "arabicName": "زعتر",
    "amazighName": "ⴰⵣⵓⴽⵏⵉ (Azukni)",
    "latinName": "Thymus vulgaris",
    "region": ["atlas", "rif", "anti-atlas"],
    "season": ["spring", "summer"],
    "useCategory": ["digestive", "respiratory", "culinary"],
    "traditionalUses": "In Moroccan households, thyme is commonly prepared as an infusion for digestive discomfort and respiratory congestion. It appears in winter preparations and is dried for year-round use. In rural Atlas communities, it is gathered from wild slopes and considered a household staple. The dried leaves are also burned for their aromatic properties in some regions.",
    "preparation": ["tea", "infusion", "dried", "fumigation"],
    "cautions": "Should not be used in large quantities during pregnancy. May cause irritation in concentrated forms. Not a substitute for medical treatment of respiratory conditions.",
    "coordinates": { "lat": 31.7917, "lng": -7.0926 }
  },
  {
    "id": "naanaa",
    "slug": "naanaa",
    "commonName": "Spearmint",
    "arabicName": "نعناع",
    "amazighName": "ⵍⵉⵇⴰⵎⴰ (Liqama)",
    "latinName": "Mentha spicata",
    "region": ["atlas", "souss", "plains", "atlantic-coast"],
    "season": ["year-round"],
    "useCategory": ["digestive", "culinary", "aromatic"],
    "traditionalUses": "Spearmint is ubiquitous in Moroccan daily life, most visibly in tea preparation. Beyond its culinary role, fresh leaves are chewed or infused for digestive ease after meals. In some households, mint water is prepared separately from tea and consumed throughout the day. The plant grows easily in home gardens and is harvested continuously.",
    "preparation": ["tea", "infusion", "fresh"],
    "cautions": "Generally considered safe in culinary amounts. Excessive consumption of concentrated preparations may cause heartburn in some individuals. Keep away from very young children in essential oil form.",
    "coordinates": { "lat": 31.6295, "lng": -7.9811 }
  },
  {
    "id": "henna",
    "slug": "henna",
    "commonName": "Henna",
    "arabicName": "حناء",
    "amazighName": "ⴰⵏⵏⴰ (Anna)",
    "latinName": "Lawsonia inermis",
    "region": ["souss", "draa", "sahara", "anti-atlas"],
    "season": ["summer", "autumn"],
    "useCategory": ["skin", "hair", "ritual"],
    "traditionalUses": "Henna occupies a central place in Moroccan material culture. The dried, powdered leaves are mixed with water or other liquids to create a paste applied to hair and skin. In southern regions, it is associated with celebrations, transitions, and weekly routines. Beyond decoration, the paste is applied to hands and feet and believed to have cooling properties in hot climates. Hair application is common among women of all ages.",
    "preparation": ["powder", "poultice"],
    "cautions": "Pure henna (lawsone) is generally safe topically. \"Black henna\" contains PPD and should be avoided due to allergy risks. Patch testing recommended before full application. Not for internal use.",
    "coordinates": { "lat": 30.9335, "lng": -6.9370 }
  },
  {
    "id": "khuzama",
    "slug": "khuzama",
    "commonName": "Lavender",
    "arabicName": "خزامى",
    "amazighName": "ⵜⵉⵣⵔⵣⴰⵢⵜ (Tizerzayt)",
    "latinName": "Lavandula angustifolia",
    "region": ["atlas", "rif", "oriental"],
    "season": ["spring", "summer"],
    "useCategory": ["aromatic", "skin", "general"],
    "traditionalUses": "Wild lavender grows abundantly in the Atlas and Rif mountains. The dried flowers are bundled and kept in homes for their scent. Infusions are prepared for general calming purposes. The plant is also distilled locally to produce floral water used in households. In some areas, dried lavender is added to grain storage.",
    "preparation": ["infusion", "dried", "oil", "fumigation"],
    "cautions": "Generally well-tolerated. Essential oil should be diluted before skin application. Not for internal use in concentrated form. Avoid during early pregnancy in medicinal doses.",
    "coordinates": { "lat": 32.8797, "lng": -5.5478 }
  },
  {
    "id": "argan",
    "slug": "argan",
    "commonName": "Argan",
    "arabicName": "أرگان",
    "amazighName": "ⴰⵔⴳⴰⵏ (Argan)",
    "latinName": "Argania spinosa",
    "region": ["souss", "anti-atlas", "atlantic-coast"],
    "season": ["summer"],
    "useCategory": ["skin", "hair", "culinary"],
    "traditionalUses": "The argan tree is endemic to southwestern Morocco and holds UNESCO biosphere status. Oil extraction is traditionally done by hand, primarily by women's cooperatives. Two types of oil are produced: roasted (culinary) and unroasted (cosmetic). The cosmetic oil is applied to skin and hair. The tree's presence defines the landscape of the Souss region and supports local economies. Goats famously climb the trees to eat the fruit.",
    "preparation": ["oil", "fresh"],
    "cautions": "Culinary oil should not be used for cosmetic purposes (different processing). Some individuals may have nut allergies. Rancid oil should be discarded. Ensure authenticity when purchasing—adulteration is common.",
    "coordinates": { "lat": 30.4278, "lng": -9.5981 }
  }
]
